export const animeData = [
    {
      id: 1,
      title: "Атака титанов",
      image: "https://oceania.ru/upload/iblock/2ae/1080x1920.png",
      rating: 10,
      release: "2013",
      description:
        "Человечество живёт за огромными стенами, спасаясь от титанов — гигантских существ, пожирающих людей. Молодой Эрен решает вступить в разведкорпус, чтобы отомстить за разрушенный город.",
      genre: ["экшен ", "драма ", "фэнтези "]
    },
    {
      id: 2,
      title: "Тетрадь смерти",
      image: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTqAt923Rq_7vBE1L2q_467Xg1WSFpvyfoeYg&s",
      rating: 10,
      release: "2006",
      description:
        "Школьник Лайт находит тетрадь, убивающую любого, чьё имя в неё вписано. Он решает изменить мир, но его преследует гениальный детектив L.",
      genre: ["триллер ", "мистика ", "детектив "]
    },
    {
      id: 3,
      title: "Ванпанчмен",
      image: "https://avatars.mds.yandex.net/get-kinopoisk-image/10671298/cd9d7966-9e76-4a1c-91d6-6b86eafe51d3/600x900",
      rating: 9,
      release: "2015",
      description:
        "Сайтама — герой, способный победить любого одним ударом. Из-за этого жизнь стала для него скучной, и он ищет достойного соперника.",
      genre: ["комедия ", "боевик ", "супергерои "]
    },
    {
      id: 4,
      title: "Токийский гуль",
      image: "https://avatars.mds.yandex.net/get-kinopoisk-image/1900788/e5d98938-605a-4c8a-b0d6-5f93d926aa0c/220x330",
      rating: 8,
      release: "2014",
      description:
        "Студент Канэки становится получеловеком-полугулем после операции. Теперь он должен выживать в мире, где гули и люди находятся в конфликте.",
      genre: ["ужасы ", "боевик ", "драма "]
    },
    {
      id: 5,
      title: "Наруто",
      image: "https://avatars.mds.yandex.net/get-kinopoisk-image/1704946/e63beb56-0433-4bbf-ae70-5d85a5ed8945/600x900",
      rating: 9,
      release: "2002",
      description:
        "Наруто — ниндзя, мечтающий стать Хокаге. Но в нём запечатан демонический лис, из-за чего его опасаются окружающие.",
      genre: ["приключения ", "боевик ", "фэнтези "]
    },
    {
      id: 6,
      title: "Твоё имя",
      image: "https://upload.wikimedia.org/wikipedia/ru/2/2c/Kimi_no_Na_wa.jpg",
      rating: 10,
      release: "2016",
      description:
        "Двое подростков внезапно начинают меняться телами. Между ними возникает связь, которая перевернёт их судьбы.",
      genre: ["драма ", "романтика ", "фэнтези "]
    },
    {
      id: 7,
      title: "Ходячий замок",
      image: "https://upload.wikimedia.org/wikipedia/ru/f/f3/%D0%9F%D0%BE%D1%81%D1%82%D0%B5%D1%80_%D0%B0%D0%BD%D0%B8%D0%BC%D0%B0%D0%BD%D0%B3%D0%B8_%C2%AB%D0%A5%D0%BE%D0%B4%D1%8F%D1%87%D0%B8%D0%B9_%D0%B7%D0%B0%D0%BC%D0%BE%D0%BA%C2%BB.jpg",
      rating: 10,
      release: "2004",
      description:
        "Девушка Софи превращена в старушку ведьмой. Её спасение — загадочный маг Хаул и его ходячий замок.",
      genre: ["фэнтези ", "драма ", "приключения "]
    },
    {
      id: 8,
      title: "Магическая битва",
      image: "https://avatars.mds.yandex.net/get-kinopoisk-image/10853012/42438e54-010a-4c84-82a8-4a74b0d0d887/220x330",
      rating: 9,
      release: "2020",
      description:
        "Юдзи Итодори вступает в школу магов после того, как поглотил проклятый палец, принадлежащий могущественному демону.",
      genre: ["боевик ", "фэнтези ", "ужасы "]
    },
    {
      id: 9,
      title: "Клинок, рассекающий демонов",
      image: "https://demonslayer-lordfilm.ru/wp-content/uploads/sites/16/2025/05/orig.jpg",
      rating: 10,
      release: "2019",
      description:
        "Тандзиро становится охотником на демонов после того, как его семью убили, а сестра превратилась в демона.",
      genre: ["боевик ", "фэнтези ", "драма "]
    },
    {
      id: 10,
      title: "Человек-безопила",
      image: "https://avatars.mds.yandex.net/get-kinopoisk-image/9784475/72fc99d6-36a9-4253-b3eb-18efc6a096fe/600x900",
      rating: 10,
      release: "2022",
      description:
        "аниме-сериал о юноше по имени Дэнджи, который из-за долгов отца вынужден охотиться на демонов с помощью своего питомца-демона, бензопилы Почиты. После того как его предают и убивают, Почита жертвует своей жизнью, чтобы возродить Дэнджи в виде гибрида человека и бензопилы, давая ему возможность исполнить свои желания, такие как свидания и простая жизнь.",
      genre: ["боевик ", "фэнтези ", "ужасы "]
    }
  ];
  